export interface ZmanimMethodDetails {
    person: string;
    method: string;
    significance: string;
    example: string;
}
export  enum ZmanimMethodType {
    Gra = 'gra',
    Mga = 'mga'
}

export interface ZmanimMethod {
    key: ZmanimMethodType;
    shortName: string;
    fullname: string;
    details: ZmanimMethodDetails;
}

export const ZmanimMethodsData: ZmanimMethod[] = [
    {
        key: ZmanimMethodType.Gra,
        shortName: 'גר"א',
        fullname: 'הגאון רבי אליהו מווילנה',
        details: {
            person: 'הגאון רבי אליהו בן שלמה זלמן קרמר, חי במאה ה-18 בליטא. נחשב לאחד מגדולי הפוסקים והפרשנים בכל הדורות, ובמיוחד בעולם הליטאי.',
            method: 'לפי הגר"א, היום ההלכתי שממנו מחשבים "שעות זמניות" (שעה שהיא 1/12 מאורך היום) מתחיל בנץ החמה (זריחה) ומסתיים בשקיעה.',
            significance: 'כל חישובי הזמנים התלויים בשעות זמניות (כמו סוף זמן קריאת שמע וסוף זמן תפילה) מתבססים על טווח הזמן שבין הזריחה לשקיעה. זוהי השיטה המקובלת והנפוצה יותר כיום ברוב הקהילות (הן הליטאיות והן הספרדיות).',
            example: '"סוף זמן קריאת שמע (גר"א)" הוא 3 שעות זמניות אחרי הנץ החמה, כאשר אורך כל שעה הוא (זמן שקיעה - זמן זריחה) / 12.'
        }
    },
    {
        key: ZmanimMethodType.Mga,
        shortName: 'מג"א',
        fullname: 'מגן אברהם',
        details: {
            person: 'רבי אברהם אבלי הלוי גומבינר, חי במאה ה-17 בפולין. פירושו "מגן אברהם" על השולחן ערוך הוא אחד מנושאי הכלים החשובים ביותר.',
            method: 'לפי המג"א, היום ההלכתי ארוך יותר. הוא מתחיל בעלות השחר ומסתיים בצאת הכוכבים.',
            significance: 'מכיוון שאורך היום לפי שיטה זו ארוך יותר, גם "שעה זמנית" ארוכה יותר. כתוצאה מכך, הזמנים המחושבים לפי שיטה זו מאוחרים יותר. זוהי שיטה מחמירה יותר, ורבים (במיוחד בקהילות חסידיות) נוהגים להחמיר על פיה.',
            example: '"סוף זמן קריאת שמע (מג"א)" הוא 3 שעות זמניות אחרי עלות השחר, כאשר אורך כל שעה הוא (זמן צאת הכוכבים - זמן עלות השחר) / 12.'
        }
    }
];